SV-CarsAPI/bzt/ForwardCars-JMeter.yaml
---
execution:
  scenario: ForwardCars
  concurrency: 10
  ramp-up: 1m
  hold-for: 5m
scenarios:
  ForwardCars:
    headers:
      User-Agent: 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10_13_6) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/68.0.3440.106 Safari/537.36'
      Accept-Encoding: 'gzip, deflate, br'
      Accept-Language: 'en-US,en;q=0.9,fr;q=0.8'
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: 'http://localhost:3434/cars-app/#/home'
            method: GET
            label: 'http://localhost:3434/cars-app/#/home'
            think-time: 0ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8'
          - url: 'http://localhost:3434/cars-app/buildInfo'
            method: GET
            label: 'http://localhost:3434/cars-app/buildInfo'
            headers:
              Accept: 'application/json, text/plain, */*'
              Referer: 'http://localhost:3434/cars-app/'
          - url: 'http://localhost:3434/cars-app/api/validate'
            method: GET
            label: 'http://localhost:3434/cars-app/api/validate'
            headers:
              Accept: 'application/json, text/plain, */*'
              Referer: 'http://localhost:3434/cars-app/'
          - url: 'http://localhost:3434/cars-app/assets/cars/navbar/navbar.html'
            method: GET
            label: 'http://localhost:3434/cars-app/assets/cars/navbar/navbar.html'
            headers:
              Accept: text/html
              Referer: 'http://localhost:3434/cars-app/'
          - url: 'http://localhost:3434/cars-app/assets/cars/home/home.html'
            method: GET
            label: 'http://localhost:3434/cars-app/assets/cars/home/home.html'
            headers:
              Accept: text/html
              Referer: 'http://localhost:3434/cars-app/'
          - url: 'http://localhost:3434/cars-app/features/'
            method: GET
            label: 'http://localhost:3434/cars-app/features/'
            headers:
              Accept: 'application/json, text/plain, */*'
              Referer: 'http://localhost:3434/cars-app/'
          - url: 'http://localhost:3434/cars-app/assets/cars/checkInventory/checkInventory.html'
            method: GET
            label: 'http://localhost:3434/cars-app/assets/cars/checkInventory/checkInventory.html'
            headers:
              Accept: text/html
              Referer: 'http://localhost:3434/cars-app/'
          - url: 'http://localhost:3434/cars-app/carsEsb'
            method: GET
            label: 'http://localhost:3434/cars-app/carsEsb'
            headers:
              Accept: 'application/json, text/plain, */*'
              Referer: 'http://localhost:3434/cars-app/'
          - url: 'http://localhost:3434/cars-app/carShop/cars'
            method: GET
            label: 'http://localhost:3434/cars-app/carShop/cars'
            headers:
              Accept: 'application/json, text/plain, */*'
              Referer: 'http://localhost:3434/cars-app/'
          - url: 'http://localhost:3434/cars-app/carShop/makes'
            method: GET
            label: 'http://localhost:3434/cars-app/carShop/makes'
            headers:
              Accept: 'application/json, text/plain, */*'
              Referer: 'http://localhost:3434/cars-app/'
          - url: 'http://localhost:3434/cars-app/assets/cars/checkInventory/carDetail.html'
            method: GET
            label: 'http://localhost:3434/cars-app/assets/cars/checkInventory/carDetail.html'
            headers:
              Accept: 'application/json, text/plain, */*'
              Referer: 'http://localhost:3434/cars-app/'
          - url: 'http://localhost:3434/cars-app/carShop/dealers'
            method: GET
            label: 'http://localhost:3434/cars-app/carShop/dealers'
            headers:
              Accept: 'application/json, text/plain, */*'
              Referer: 'http://localhost:3434/cars-app/'
          - url: 'http://localhost:3434/cars-app/carShop/makes'
            method: GET
            label: 'http://localhost:3434/cars-app/carShop/makes'
            headers:
              Accept: 'application/json, text/plain, */*'
              Referer: 'http://localhost:3434/cars-app/'
          - url: 'http://localhost:3434/cars-app/carShop/car/2T1KR32E37C639014'
            method: GET
            label: 'http://localhost:3434/cars-app/carShop/car/2T1KR32E37C639014'
            headers:
              Accept: 'application/json, text/plain, */*'
              Referer: 'http://localhost:3434/cars-app/'
          - url: 'http://localhost:3434/cars-app/carShop/makes/1/models'
            method: GET
            label: 'http://localhost:3434/cars-app/carShop/makes/1/models'
            headers:
              Accept: 'application/json, text/plain, */*'
              Referer: 'http://localhost:3434/cars-app/'
          - url: 'http://localhost:3434/cars-app/carShop/makes/2/models'
            method: GET
            label: 'http://localhost:3434/cars-app/carShop/makes/2/models'
            headers:
              Accept: 'application/json, text/plain, */*'
              Referer: 'http://localhost:3434/cars-app/'
          - url: 'http://localhost:3434/cars-app/carShop/dealers'
            method: GET
            label: 'http://localhost:3434/cars-app/carShop/dealers'
            headers:
              Accept: 'application/json, text/plain, */*'
              Referer: 'http://localhost:3434/cars-app/'
          - url: 'http://localhost:3434/cars-app/carShop/makes'
            method: GET
            label: 'http://localhost:3434/cars-app/carShop/makes'
            headers:
              Accept: 'application/json, text/plain, */*'
              Referer: 'http://localhost:3434/cars-app/'
          - url: 'http://localhost:3434/cars-app/carShop/car/3N1CB51D35l458773'
            method: GET
            label: 'http://localhost:3434/cars-app/carShop/car/3N1CB51D35l458773'
            headers:
              Accept: 'application/json, text/plain, */*'
              Referer: 'http://localhost:3434/cars-app/'
          - url: 'http://localhost:3434/cars-app/carShop/makes/1/models'
            method: GET
            label: 'http://localhost:3434/cars-app/carShop/makes/1/models'
            headers:
              Accept: 'application/json, text/plain, */*'
              Referer: 'http://localhost:3434/cars-app/'
          - url: 'http://localhost:3434/cars-app/carShop/makes/2/models'
            method: GET
            label: 'http://localhost:3434/cars-app/carShop/makes/2/models'
            headers:
              Accept: 'application/json, text/plain, */*'
              Referer: 'http://localhost:3434/cars-app/'
          - url: 'http://localhost:3434/cars-app/carShop/dealers'
            method: GET
            label: 'http://localhost:3434/cars-app/carShop/dealers'
            headers:
              Accept: 'application/json, text/plain, */*'
              Referer: 'http://localhost:3434/cars-app/'
          - url: 'http://localhost:3434/cars-app/carShop/makes'
            method: GET
            label: 'http://localhost:3434/cars-app/carShop/makes'
            headers:
              Accept: 'application/json, text/plain, */*'
              Referer: 'http://localhost:3434/cars-app/'
          - url: 'http://localhost:3434/cars-app/carShop/car/3N1CB51D35l458774'
            method: GET
            label: 'http://localhost:3434/cars-app/carShop/car/3N1CB51D35l458774'
            headers:
              Accept: 'application/json, text/plain, */*'
              Referer: 'http://localhost:3434/cars-app/'
          - url: 'http://localhost:3434/cars-app/carShop/makes/1/models'
            method: GET
            label: 'http://localhost:3434/cars-app/carShop/makes/1/models'
            headers:
              Accept: 'application/json, text/plain, */*'
              Referer: 'http://localhost:3434/cars-app/'
          - url: 'http://localhost:3434/cars-app/carShop/makes/3/models'
            method: GET
            label: 'http://localhost:3434/cars-app/carShop/makes/3/models'
            headers:
              Accept: 'application/json, text/plain, */*'
              Referer: 'http://localhost:3434/cars-app/'
          - url: 'http://localhost:3434/cars-app/carShop/dealers'
            method: GET
            label: 'http://localhost:3434/cars-app/carShop/dealers'
            headers:
              Accept: 'application/json, text/plain, */*'
              Referer: 'http://localhost:3434/cars-app/'
          - url: 'http://localhost:3434/cars-app/carShop/makes'
            method: GET
            label: 'http://localhost:3434/cars-app/carShop/makes'
            headers:
              Accept: 'application/json, text/plain, */*'
              Referer: 'http://localhost:3434/cars-app/'
          - url: 'http://localhost:3434/cars-app/carShop/car/1ZVBP8AM1D5256906'
            method: GET
            label: 'http://localhost:3434/cars-app/carShop/car/1ZVBP8AM1D5256906'
            headers:
              Accept: 'application/json, text/plain, */*'
              Referer: 'http://localhost:3434/cars-app/'
          - url: 'http://localhost:3434/cars-app/carShop/makes/1/models'
            method: GET
            label: 'http://localhost:3434/cars-app/carShop/makes/1/models'
            headers:
              Accept: 'application/json, text/plain, */*'
              Referer: 'http://localhost:3434/cars-app/'
          - url: 'http://localhost:3434/cars-app/carShop/makes/2/models'
            method: GET
            label: 'http://localhost:3434/cars-app/carShop/makes/2/models'
            headers:
              Accept: 'application/json, text/plain, */*'
              Referer: 'http://localhost:3434/cars-app/'
          - url: 'http://localhost:3434/cars-app/carShop/makes/3/models'
            method: GET
            label: 'http://localhost:3434/cars-app/carShop/makes/3/models'
            headers:
              Accept: 'application/json, text/plain, */*'
              Referer: 'http://localhost:3434/cars-app/'
          - url: 'http://localhost:3434/cars-app/carShop/dealers'
            method: GET
            label: 'http://localhost:3434/cars-app/carShop/dealers'
            headers:
              Accept: 'application/json, text/plain, */*'
              Referer: 'http://localhost:3434/cars-app/'
          - url: 'http://localhost:3434/cars-app/carShop/makes'
            method: GET
            label: 'http://localhost:3434/cars-app/carShop/makes'
            headers:
              Accept: 'application/json, text/plain, */*'
              Referer: 'http://localhost:3434/cars-app/'
          - url: 'http://localhost:3434/cars-app/carShop/car/1XCBP8AM1D5256909'
            method: GET
            label: 'http://localhost:3434/cars-app/carShop/car/1XCBP8AM1D5256909'
            headers:
              Accept: 'application/json, text/plain, */*'
              Referer: 'http://localhost:3434/cars-app/'
          - url: 'http://localhost:3434/cars-app/carShop/makes/3/models'
            method: GET
            label: 'http://localhost:3434/cars-app/carShop/makes/3/models'
            headers:
              Accept: 'application/json, text/plain, */*'
              Referer: 'http://localhost:3434/cars-app/'
          - url: 'http://localhost:3434/cars-app/carShop/makes/1/models'
            method: GET
            label: 'http://localhost:3434/cars-app/carShop/makes/1/models'
            headers:
              Accept: 'application/json, text/plain, */*'
              Referer: 'http://localhost:3434/cars-app/'